In [3]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/win

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%sql SELECT * FROM ipl LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/win
3 rows affected.

[(1312200, 1, 0, 1, 'YBK Jaiswal', 'Mohammed Shami', 'JC Buttler', None, 0, 0, 0, 0, 0, None, None, None, 'Rajasthan Royals'),
 (1312200, 1, 0, 2, 'YBK Jaiswal', 'Mohammed Shami', 'JC Buttler', 'legbyes', 0, 1, 1, 0, 0, None, None, None, 'Rajasthan Royals'),
 (1312200, 1, 0, 3, 'JC Buttler', 'Mohammed Shami', 'YBK Jaiswal', None, 1, 0, 1, 0, 0, None, None, None, 'Rajasthan Royals')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Ranking</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find Top 5 Batsman in Team</div>

In [9]:
%%sql 
SELECT * FROM 
    (SELECT 
     
    BattingTeam,batter,SUM(batsman_run) AS `total_runs`,
    DENSE_RANK() OVER(PARTITION BY BattingTeam ORDER BY total_runs DESC) AS rank

    FROM ipl
    GROUP BY BattingTeam,batter) t1

WHERE t1.rank < 6

ORDER BY t1.BattingTeam ASC, t1.rank ASC
LIMIT 38,5

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[('Kochi Tuskers Kerala', 'RA Jadeja', Decimal('283'), 4),
 ('Kochi Tuskers Kerala', 'PA Patel', Decimal('202'), 5),
 ('Kolkata Knight Riders', 'G Gambhir', Decimal('3035'), 1),
 ('Kolkata Knight Riders', 'RV Uthappa', Decimal('2441'), 2),
 ('Kolkata Knight Riders', 'AD Russell', Decimal('1981'), 3)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Cumulative sum<ul>Cumulative sum is another type of calculation that can be performed using
window functions. A cumulative sum calculates the sum of a set of values up to a
given point in time, and includes all previous values in the calculation.<br><ol>{a,b,c..} = a,a+b,a+b+c ...</ol></ul></div>

In [100]:
%sql SELECT * FROM marks

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[(1, 80), (2, 85), (3, 90), (4, 78), (5, 95)]

In [150]:
%%sql SELECT *
,
SUM(marks) OVER(ORDER BY student_id ASC ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) AS normal_sum,
SUM(marks) OVER(ORDER BY student_id ASC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS cumulative_sum
FROM marks

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[(1, 80, Decimal('428'), Decimal('80')),
 (2, 85, Decimal('428'), Decimal('165')),
 (3, 90, Decimal('428'), Decimal('255')),
 (4, 78, Decimal('428'), Decimal('333')),
 (5, 95, Decimal('428'), Decimal('428'))]

In [16]:
%sql SELECT * FROM ipl LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/win
3 rows affected.

[(1312200, 1, 0, 1, 'YBK Jaiswal', 'Mohammed Shami', 'JC Buttler', None, 0, 0, 0, 0, 0, None, None, None, 'Rajasthan Royals'),
 (1312200, 1, 0, 2, 'YBK Jaiswal', 'Mohammed Shami', 'JC Buttler', 'legbyes', 0, 1, 1, 0, 0, None, None, None, 'Rajasthan Royals'),
 (1312200, 1, 0, 3, 'JC Buttler', 'Mohammed Shami', 'YBK Jaiswal', None, 1, 0, 1, 0, 0, None, None, None, 'Rajasthan Royals')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">How many runs and careerruns of V Kohli In First 10 Matchs</ul></div>

In [160]:
%%sql

SELECT 

CONCAT('Match-', CAST(ROW_NUMBER() OVER(ORDER BY ID) AS CHAR) ) AS `match_no`,

SUM(batsman_run) AS `runs`,
SUM(SUM(batsman_run)) OVER w AS `career_runs`

FROM ipl
WHERE batter = 'V Kohli'
GROUP BY ID

WINDOW w AS (ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) 

LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/win
10 rows affected.

[('Match-1', Decimal('1'), Decimal('1')),
 ('Match-2', Decimal('23'), Decimal('24')),
 ('Match-3', Decimal('13'), Decimal('37')),
 ('Match-4', Decimal('12'), Decimal('49')),
 ('Match-5', Decimal('1'), Decimal('50')),
 ('Match-6', Decimal('9'), Decimal('59')),
 ('Match-7', Decimal('34'), Decimal('93')),
 ('Match-8', Decimal('0'), Decimal('93')),
 ('Match-9', Decimal('21'), Decimal('114')),
 ('Match-10', Decimal('3'), Decimal('117'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">How many runs and career runs V Kohli of 1, 5, 10th Match</ul></div>

In [162]:
%%sql

SELECT * FROM (

SELECT 
CONCAT('Match-', CAST(ROW_NUMBER() OVER(ORDER BY ID) AS CHAR) ) AS `match_no`,
SUM(batsman_run) AS `runs`,
SUM(SUM(batsman_run)) OVER w AS `career_runs`

FROM ipl
WHERE batter = 'V Kohli'
GROUP BY ID

WINDOW w AS (ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) 

)t

WHERE match_no IN('Match-1','Match-5','Match-10')
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/win
3 rows affected.

[('Match-1', Decimal('1'), Decimal('1')),
 ('Match-5', Decimal('1'), Decimal('50')),
 ('Match-10', Decimal('3'), Decimal('117'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">How many runs and career runs V Kohli 58th, 100th, 200th Match</ul></div>

In [163]:
%%sql

SELECT * FROM (

SELECT 
CONCAT('Match-', CAST(ROW_NUMBER() OVER(ORDER BY ID) AS CHAR) ) AS `match_no`,
SUM(batsman_run) AS `runs`,
SUM(SUM(batsman_run)) OVER w AS `career_runs`

    FROM ipl
WHERE batter = 'V Kohli'
GROUP BY ID

WINDOW w AS (ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) 

)t

WHERE match_no IN('Match-1','Match-100','Match-200')

 * mysql+pymysql://root:***@localhost:3307/win
3 rows affected.

[('Match-1', Decimal('1'), Decimal('1')),
 ('Match-100', Decimal('13'), Decimal('2650')),
 ('Match-200', Decimal('41'), Decimal('6334'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Cumulative Average<ul>Cumulative average is another type of average that can be calculated using
window functions. A cumulative average calculates the average of a set of values
up to a given point in time, and includes all previous values in the calculation.<ol>X1+Xn / len(X) 
</ol></ul></div>

In [164]:
%sql SELECT * FROM marks

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[(1, 80), (2, 85), (3, 90), (4, 78), (5, 95)]

In [197]:
lst = [80,85,90,78,95]

print(80+85+90+78+95/len(lst)) # normal avg

352.0

In [213]:
print(80/1)
print((80+85)/2)
print((80+85+90)/3)
print((80+85+90+78)/4)
print((80+85+90+78+95)/5)
# example of cumulative avg

80.0
82.5
85.0
83.25
85.6

In [217]:
%%sql SELECT *
,
AVG(marks) OVER(ORDER BY student_id ASC ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) AS normal_avg,
AVG(marks) OVER(ORDER BY student_id ASC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS cumulative_avg
FROM marks

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[(1, 80, Decimal('85.6000'), Decimal('80.0000')),
 (2, 85, Decimal('85.6000'), Decimal('82.5000')),
 (3, 90, Decimal('85.6000'), Decimal('85.0000')),
 (4, 78, Decimal('85.6000'), Decimal('83.2500')),
 (5, 95, Decimal('85.6000'), Decimal('85.6000'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">How many career runs V Kohli first 5 career match and also find avg</ul></div>

In [219]:
%%sql

SELECT * FROM (

SELECT 
CONCAT('Match-', CAST(ROW_NUMBER() OVER(ORDER BY ID) AS CHAR) ) AS `match_no`,

SUM(batsman_run) AS `runs`,
SUM(SUM(batsman_run)) OVER w AS `career_runs`,
    
AVG(SUM(batsman_run)) OVER w AS `avg`

FROM ipl
WHERE batter = 'V Kohli'
GROUP BY ID

WINDOW w AS (ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) 

)t

WHERE match_no IN('Match-1','Match-2','Match-3','Match-4','Match-5')

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[('Match-1', Decimal('1'), Decimal('1'), Decimal('1.0000')),
 ('Match-2', Decimal('23'), Decimal('24'), Decimal('12.0000')),
 ('Match-3', Decimal('13'), Decimal('37'), Decimal('12.3333')),
 ('Match-4', Decimal('12'), Decimal('49'), Decimal('12.2500')),
 ('Match-5', Decimal('1'), Decimal('50'), Decimal('10.0000'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Running Average<ul><p>Running average is a statistical concept used in time series data analysis. <br>It involves calculating the average of a set number of consecutive data points as you move through the dataset. </p><br><p>As each new data point is encountered, the average is updated by considering the latest data point along with a specified number of previous data points. <br>This helps to smooth out fluctuations in the data and reveal underlying trends over time. <br><br>The size of the set of data points considered, often referred to as the "window size," determines how much historical data influences the running average.</p><ol>X1+X(window_size) / len(X)</ol></ul></div>

In [2]:
%sql SELECT * FROM marks

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[(1, 80), (2, 85), (3, 90), (4, 78), (5, 95)]

In [3]:
# [ n() / len(n) ] window_size  formulae

lst = [80,85,90,78,95]

print((80) / 1)
print((80+85) / 2)

print((80+85+90) / 3)
print((85+90+78) / 3)
print((90+78+95) / 3)

80.0
82.5
85.0
84.33333333333333
87.66666666666667

In [281]:
%%sql
SELECT * ,
AVG(marks) OVER(ORDER BY student_id ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) AS normal_avg,
AVG(marks) OVER(ORDER BY student_id ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) AS running_avg
FROM marks

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[(1, 80, Decimal('85.6000'), Decimal('80.0000')),
 (2, 85, Decimal('85.6000'), Decimal('82.5000')),
 (3, 90, Decimal('85.6000'), Decimal('85.0000')),
 (4, 78, Decimal('85.6000'), Decimal('84.3333')),
 (5, 95, Decimal('85.6000'), Decimal('87.6667'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Change size</div>

In [6]:
# [ n() / len(n) ] window_size  formulae

lst = [80,85,90,78,95]

print((80) / 1)
print((80+85) / 2)

print((80+85+90) / 3)
print((80+85+90+78) / 4)
print((85+90+78+95) / 4)

80.0
82.5
85.0
83.25
87.0

In [7]:
%%sql
SELECT * ,
AVG(marks) OVER(ORDER BY student_id ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) AS normal_avg,
AVG(marks) OVER(ORDER BY student_id ROWS BETWEEN 3 PRECEDING AND CURRENT ROW) AS running_avg
FROM marks

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[(1, 80, Decimal('85.6000'), Decimal('80.0000')),
 (2, 85, Decimal('85.6000'), Decimal('82.5000')),
 (3, 90, Decimal('85.6000'), Decimal('85.0000')),
 (4, 78, Decimal('85.6000'), Decimal('83.2500')),
 (5, 95, Decimal('85.6000'), Decimal('87.0000'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">How many career runs V Kohli first 5 career match and also find avg and also find running avg</ul></div>

In [17]:
%%sql

SELECT * FROM (

SELECT 
CONCAT('Match-', CAST(ROW_NUMBER() OVER(ORDER BY ID) AS CHAR) ) AS `match_no`,

SUM(batsman_run) AS `runs`,
SUM(SUM(batsman_run)) OVER w AS `career_runs`,
AVG(SUM(batsman_run)) OVER w AS `avg`,
AVG(SUM(batsman_run)) OVER(ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) AS `running_avg`

FROM ipl
WHERE batter = 'V Kohli'
GROUP BY ID

WINDOW w AS (ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) 

)t

WHERE match_no IN('Match-1','Match-2','Match-3','Match-4','Match-5')

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[('Match-1', Decimal('1'), Decimal('1'), Decimal('1.0000'), Decimal('1.0000')),
 ('Match-2', Decimal('23'), Decimal('24'), Decimal('12.0000'), Decimal('12.0000')),
 ('Match-3', Decimal('13'), Decimal('37'), Decimal('12.3333'), Decimal('12.3333')),
 ('Match-4', Decimal('12'), Decimal('49'), Decimal('12.2500'), Decimal('16.0000')),
 ('Match-5', Decimal('1'), Decimal('50'), Decimal('10.0000'), Decimal('8.6667'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Percent of total<ul><p>Percent of total refers to the percentage or proportion of a specific value in
relation to the total value. <br>It is a commonly used metric to represent the relative
importance or contribution of a particular value within a larger group or
population.</p><ol>(important_quantity / sum(whole data) )  * 100</ol></ul></div>

In [18]:
%sql SELECT * FROM marks

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[(1, 80), (2, 85), (3, 90), (4, 78), (5, 95)]

In [25]:
# formula 
# (important_quantity / sum(whole data) )  * 100

lst = [80,85,90,78,95]

important_quantity = max(lst) # 95

print(80+85+90+78+95)
print((95/428)*100)

print((important_quantity/sum(lst)) * 100)

428
22.19626168224299
22.19626168224299

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Without window function</div>

In [35]:
%%sql
SELECT * 
, ((MAX(marks) OVER() / SUM(marks) OVER()) * 100) AS percent_of_total
FROM 
marks

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[(3, 90, Decimal('22.1963')),
 (4, 78, Decimal('22.1963')),
 (5, 95, Decimal('22.1963')),
 (1, 80, Decimal('22.1963')),
 (2, 85, Decimal('22.1963'))]

In [37]:
%%sql
SELECT ((MAX(marks)  / SUM(marks) ) * 100) AS percent_of_total
FROM 
marks

 * mysql+pymysql://root:***@localhost:3307/win
1 rows affected.

[(Decimal('22.1963'),)]

In [40]:
%sql SELECT * FROM zomato.orders LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/win
3 rows affected.

[(1001, 1, 1, 550, '2022-05-10', 1, 25, 5, 3.0),
 (1002, 1, 2, 415, '2022-05-26', 1, 19, 5, 2.0),
 (1003, 1, 3, 240, '2022-06-15', 5, 29, 4, None)]

In [48]:
%sql SELECT * FROM zomato.order_details LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/win
3 rows affected.

[(1, 1001, 1), (2, 1001, 3), (3, 1002, 4)]

In [71]:
%%sql

SELECT f_id,SUM(amount) AS `total_amount` FROM zomato.orders t1
    INNER JOIN zomato.order_details t2
    ON t1.order_id = t2.order_id
    WHERE r_id = 1
    GROUP BY f_id

 * mysql+pymysql://root:***@localhost:3307/win
3 rows affected.

[(1, Decimal('3050')), (2, Decimal('950')), (3, Decimal('2600'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now find Percent of total for all total_amount</div>

In [72]:
%%sql

SELECT *,(total_amount/SUM(total_amount) OVER()) * 100  AS `percent_of_total` FROM(
    SELECT f_id,SUM(amount) AS `total_amount` FROM zomato.orders t1
    INNER JOIN zomato.order_details t2
    ON t1.order_id = t2.order_id
    WHERE r_id = 1
    GROUP BY f_id

) t1

 * mysql+pymysql://root:***@localhost:3307/win
3 rows affected.

[(2, Decimal('950'), Decimal('14.3939')),
 (3, Decimal('2600'), Decimal('39.3939')),
 (1, Decimal('3050'), Decimal('46.2121'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now find Percent of total with maximum total_amount </div>

In [82]:
lst = [950,2600,3050]

(max(lst)/sum(lst))* 100

46.21212121212121

In [78]:
%%sql

SELECT *,((MAX(total_amount) OVER()) /SUM(total_amount) OVER()) * 100  AS `percent_of_total` FROM(
    SELECT f_id,SUM(amount) AS `total_amount` FROM zomato.orders t1
    INNER JOIN zomato.order_details t2
    ON t1.order_id = t2.order_id
    WHERE r_id = 1
    GROUP BY f_id

) t1

 * mysql+pymysql://root:***@localhost:3307/win
3 rows affected.

[(2, Decimal('950'), Decimal('46.2121')),
 (1, Decimal('3050'), Decimal('46.2121')),
 (3, Decimal('2600'), Decimal('46.2121'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Percent Change<ul><p>Percent of total refers to the percentage or proportion of a specific value in
relation to the total value. <br>It is a commonly used metric to represent the relative
importance or contribution of a particular value within a larger group or
population.</p><br>percent_change  = (new_value - old_value) / old_value * 100</ul></div>

In [84]:
%sql SELECT * FROM monthly_views

 * mysql+pymysql://root:***@localhost:3307/win
10 rows affected.

[('January', 500),
 ('February', 550),
 ('March', 600),
 ('April', 580),
 ('May', 620),
 ('June', 700),
 ('July', 750),
 ('August', 800),
 ('September', 750),
 ('October', 700)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now JOIN data and Comparision on the Month of October</div>

In [90]:
%%sql

SELECT 
    m1.month_name AS old_month,
    m2.month_name AS new_month,
    m1.views AS old_views,
    m2.views AS new_views

FROM 
    monthly_views m1

INNER JOIN monthly_views m2 
ON m1.month_name = 'October' AND m2.month_name != 'October';

 * mysql+pymysql://root:***@localhost:3307/win
9 rows affected.

[('October', 'January', 700, 500),
 ('October', 'February', 700, 550),
 ('October', 'March', 700, 600),
 ('October', 'April', 700, 580),
 ('October', 'May', 700, 620),
 ('October', 'June', 700, 700),
 ('October', 'July', 700, 750),
 ('October', 'August', 700, 800),
 ('October', 'September', 700, 750)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now use Percent Change on the basis of old_views and new_views</div>

In [93]:
%%sql

SELECT 
    m1.month_name AS old_month,
    m2.month_name AS new_month,
    m1.views AS old_views,
    m2.views AS new_views,

    ((m1.views - m2.views) / m1.views) * 100 AS percent_change

FROM 
    monthly_views m1

INNER JOIN monthly_views m2 
ON m1.month_name = 'October' AND m2.month_name != 'October';

 * mysql+pymysql://root:***@localhost:3307/win
9 rows affected.

[('October', 'January', 700, 500, Decimal('28.5714')),
 ('October', 'February', 700, 550, Decimal('21.4286')),
 ('October', 'March', 700, 600, Decimal('14.2857')),
 ('October', 'April', 700, 580, Decimal('17.1429')),
 ('October', 'May', 700, 620, Decimal('11.4286')),
 ('October', 'June', 700, 700, Decimal('0.0000')),
 ('October', 'July', 700, 750, Decimal('-7.1429')),
 ('October', 'August', 700, 800, Decimal('-14.2857')),
 ('October', 'September', 700, 750, Decimal('-7.1429'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Apply Change Percent on Months with Window function </div>

In [154]:
%%sql 
SELECT *,

(CASE month_name
 WHEN "January" THEN 1
 WHEN "February" THEN 2
 WHEN "March" THEN 3
 WHEN "April" THEN 4
 WHEN "May" THEN 5
 WHEN "June" THEN 6
 WHEN "July" THEN 7
 WHEN "August" THEN 8
 WHEN "September" THEN 9
 WHEN "October" THEN 10
END) AS month_number

FROM monthly_views

 * mysql+pymysql://root:***@localhost:3307/win
10 rows affected.

[('January', 500, 1),
 ('February', 550, 2),
 ('March', 600, 3),
 ('April', 580, 4),
 ('May', 620, 5),
 ('June', 700, 6),
 ('July', 750, 7),
 ('August', 800, 8),
 ('September', 750, 9),
 ('October', 700, 10)]

In [2]:
%%sql 

SELECT *,

COALESCE(LAG(views) OVER(ORDER BY month_number),0) AS old_value,
COALESCE(LEAD(views) OVER(ORDER BY month_number),0) AS new_value,

((COALESCE(LEAD(views) OVER(ORDER BY month_number),0) - COALESCE(LAG(views) OVER(ORDER BY month_number),0)) 
    / 
COALESCE(LAG(views) OVER(ORDER BY month_number),0)) * 100 AS percent_change

FROM (
    SELECT *,
    (CASE month_name
     WHEN "January" THEN 1
     WHEN "February" THEN 2
     WHEN "March" THEN 3
     WHEN "April" THEN 4
     WHEN "May" THEN 5
     WHEN "June" THEN 6
     WHEN "July" THEN 7
     WHEN "August" THEN 8
     WHEN "September" THEN 9
     WHEN "October" THEN 10
    END) AS month_number
    FROM monthly_views
    ) t1

 * mysql+pymysql://root:***@localhost:3307/win
10 rows affected.

[('January', 500, 1, 0, 550, None),
 ('February', 550, 2, 500, 600, Decimal('20.0000')),
 ('March', 600, 3, 550, 580, Decimal('5.4545')),
 ('April', 580, 4, 600, 620, Decimal('3.3333')),
 ('May', 620, 5, 580, 700, Decimal('20.6897')),
 ('June', 700, 6, 620, 750, Decimal('20.9677')),
 ('July', 750, 7, 700, 800, Decimal('14.2857')),
 ('August', 800, 8, 750, 750, Decimal('0.0000')),
 ('September', 750, 9, 800, 700, Decimal('-12.5000')),
 ('October', 700, 10, 750, 0, Decimal('-100.0000'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Quantiles<ul><p>A Quantile is a measure of the distribution of a dataset that divides the data into any number of equally sized intervals.
   <br><br>Formula<br>((Current Row  - 1) / total Row * ) 100 <br>
</ul>
<br><br>
<hr>
First Quartile

<ul><li>A dataset could be divided into 4 parts Called Q1 First Quartile</li>

In [351]:
%sql SELECT * FROM student_marks

 * mysql+pymysql://root:***@localhost:3307/win
17 rows affected.

[(1, 'Nitish', 'EEE', 82),
 (2, 'Rishabh', 'EEE', 91),
 (3, 'Anukant', 'EEE', 69),
 (4, 'Rupesh', 'EEE', 55),
 (5, 'Shubham', 'CSE', 78),
 (6, 'Ved', 'CSE', 43),
 (7, 'Deepak', 'CSE', 98),
 (8, 'Arpan', 'CSE', 95),
 (9, 'Vinay', 'ECE', 95),
 (10, 'Ankit', 'ECE', 88),
 (11, 'Anand', 'ECE', 81),
 (12, 'Rohit', 'ECE', 95),
 (13, 'Prashant', 'MECH', 75),
 (14, 'Amit', 'MECH', 69),
 (15, 'Sunny', 'MECH', 39),
 (16, 'Gautam', 'MECH', 51),
 (17, 'Abhi', 'EEE', 1)]

In [373]:
%%sql

SELECT * FROM (

SELECT *,
( (count-1) / total) * 100 AS percentile,

    CASE 
        WHEN ((count-1) / total) * 100 >= 0 AND ((count-1) / total) * 100 < 25 THEN 'Q1 25%'
        WHEN ((count-1) / total) * 100 >= 25 AND ((count-1) / total) * 100 < 50 THEN 'Q2 50%'
        WHEN ((count-1) / total) * 100 >= 50 AND ((count-1) / total) * 100 < 75 THEN 'Q3 75%'
        WHEN ((count-1) / total) * 100 >= 75 AND ((count-1) / total) * 100 <= 100 THEN 'Q4 100%'
        ELSE NULL
    END AS Quartile

FROM 

(   
    SELECT *,
    COUNT(marks) OVER(ORDER BY marks ASC) AS count,
    COUNT(*) OVER() AS total
    FROM student_marks
) t1

) main

WHERE main.percentile >= 0 AND main.percentile <= 25

 * mysql+pymysql://root:***@localhost:3307/win
5 rows affected.

[(17, 'Abhi', 'EEE', 1, 1, 17, Decimal('0.0000'), 'Q1 25%'),
 (15, 'Sunny', 'MECH', 39, 2, 17, Decimal('5.8824'), 'Q1 25%'),
 (6, 'Ved', 'CSE', 43, 3, 17, Decimal('11.7647'), 'Q1 25%'),
 (16, 'Gautam', 'MECH', 51, 4, 17, Decimal('17.6471'), 'Q1 25%'),
 (4, 'Rupesh', 'EEE', 55, 5, 17, Decimal('23.5294'), 'Q1 25%')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Second Quartile (Median, Q2)<ul><p>The second quartile, also known as the median (Q2), divides the dataset into two equal parts. <br>Therefore, the median splits the dataset into two parts, each containing 50% of the data. <br>In terms of parts, the median divides the data into two equal halves.</p></ul>

In [377]:
%%sql

SELECT * FROM (

SELECT *,
( (count-1) / total) * 100 AS percentile,

    CASE 
        WHEN ((count-1) / total) * 100 >= 0 AND ((count-1) / total) * 100 < 25 THEN 'Q1 25%'
        WHEN ((count-1) / total) * 100 >= 25 AND ((count-1) / total) * 100 < 50 THEN 'Q2 50%'
        WHEN ((count-1) / total) * 100 >= 50 AND ((count-1) / total) * 100 < 75 THEN 'Q3 75%'
        WHEN ((count-1) / total) * 100 >= 75 AND ((count-1) / total) * 100 <= 100 THEN 'Q4 100%'
        ELSE NULL
    END AS Quartile

FROM 

(   
    SELECT *,
    COUNT(marks) OVER(ORDER BY marks ASC) AS count,
    COUNT(*) OVER() AS total
    FROM student_marks
) t1

) main

WHERE main.percentile >= 25 AND main.percentile <= 50

 * mysql+pymysql://root:***@localhost:3307/win
4 rows affected.

[(3, 'Anukant', 'EEE', 69, 7, 17, Decimal('35.2941'), 'Q2 50%'),
 (14, 'Amit', 'MECH', 69, 7, 17, Decimal('35.2941'), 'Q2 50%'),
 (13, 'Prashant', 'MECH', 75, 8, 17, Decimal('41.1765'), 'Q2 50%'),
 (5, 'Shubham', 'CSE', 78, 9, 17, Decimal('47.0588'), 'Q2 50%')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Q3 (Third Quartile)<ul><p>The third quartile, also known as Q3, divides the dataset into three parts.<br> The lower part, between the minimum value and Q3, contains 75% of the data. <br>The upper part, between Q3 and the maximum value, also contains 25% of the data.</p></ul>

In [378]:
%%sql

SELECT * FROM (

SELECT *,
( (count-1) / total) * 100 AS percentile,

    CASE 
        WHEN ((count-1) / total) * 100 >= 0 AND ((count-1) / total) * 100 < 25 THEN 'Q1 25%'
        WHEN ((count-1) / total) * 100 >= 25 AND ((count-1) / total) * 100 < 50 THEN 'Q2 50%'
        WHEN ((count-1) / total) * 100 >= 50 AND ((count-1) / total) * 100 < 75 THEN 'Q3 75%'
        WHEN ((count-1) / total) * 100 >= 75 AND ((count-1) / total) * 100 <= 100 THEN 'Q4 100%'
        ELSE NULL
    END AS Quartile

FROM 

(   
    SELECT *,
    COUNT(marks) OVER(ORDER BY marks ASC) AS count,
    COUNT(*) OVER() AS total
    FROM student_marks
) t1

) main

WHERE main.percentile >= 50 AND main.percentile <= 75

 * mysql+pymysql://root:***@localhost:3307/win
4 rows affected.

[(11, 'Anand', 'ECE', 81, 10, 17, Decimal('52.9412'), 'Q3 75%'),
 (1, 'Nitish', 'EEE', 82, 11, 17, Decimal('58.8235'), 'Q3 75%'),
 (10, 'Ankit', 'ECE', 88, 12, 17, Decimal('64.7059'), 'Q3 75%'),
 (2, 'Rishabh', 'EEE', 91, 13, 17, Decimal('70.5882'), 'Q3 75%')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Percentile<ul><p>Percentile (P) represents a specific percentage of data below a given value in a dataset. <br>It is a measure that indicates the relative standing or position of a particular value within a dataset. <br> In Percentile  Data are Divided into 100 Parts</p></ul>

In [379]:
%%sql

SELECT * FROM (

SELECT *,
( (count-1) / total) * 100 AS percentile,

    CASE 
        WHEN ((count-1) / total) * 100 >= 0 AND ((count-1) / total) * 100 < 25 THEN 'Q1 25%'
        WHEN ((count-1) / total) * 100 >= 25 AND ((count-1) / total) * 100 < 50 THEN 'Q2 50%'
        WHEN ((count-1) / total) * 100 >= 50 AND ((count-1) / total) * 100 < 75 THEN 'Q3 75%'
        WHEN ((count-1) / total) * 100 >= 75 AND ((count-1) / total) * 100 <= 100 THEN 'Q4 100%'
        ELSE NULL
    END AS Quartile

FROM 

(   
    SELECT *,
    COUNT(marks) OVER(ORDER BY marks ASC) AS count,
    COUNT(*) OVER() AS total
    FROM student_marks
) t1

) main

WHERE main.percentile >= 75

 * mysql+pymysql://root:***@localhost:3307/win
4 rows affected.

[(8, 'Arpan', 'CSE', 95, 16, 17, Decimal('88.2353'), 'Q4 100%'),
 (12, 'Rohit', 'ECE', 95, 16, 17, Decimal('88.2353'), 'Q4 100%'),
 (9, 'Vinay', 'ECE', 95, 16, 17, Decimal('88.2353'), 'Q4 100%'),
 (7, 'Deepak', 'CSE', 98, 17, 17, Decimal('94.1176'), 'Q4 100%')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">show Full data</div>

In [380]:
%%sql
SELECT *,

( (count-1) / total) * 100 AS percentile,

CASE 
    
    WHEN ((count-1) / total) * 100 >= 0 AND ((count-1) / total) * 100 < 25 THEN 'Q1 25%'
    WHEN ((count-1) / total) * 100 >= 25 AND ((count-1) / total) * 100 < 50 THEN 'Q2 50%'
    WHEN ((count-1) / total) * 100 >= 50 AND ((count-1) / total) * 100 < 75 THEN 'Q3 75%'
    WHEN ((count-1) / total) * 100 >= 75 AND ((count-1) / total) * 100 <= 100 THEN 'Q4 100%'
    ELSE NULL
END AS Quartile

FROM 
(   
    SELECT *,
    COUNT(marks) OVER(ORDER BY marks ASC) AS count,
    COUNT(*) OVER() AS total
    FROM student_marks
) t1;

 * mysql+pymysql://root:***@localhost:3307/win
17 rows affected.

[(17, 'Abhi', 'EEE', 1, 1, 17, Decimal('0.0000'), 'Q1 25%'),
 (15, 'Sunny', 'MECH', 39, 2, 17, Decimal('5.8824'), 'Q1 25%'),
 (6, 'Ved', 'CSE', 43, 3, 17, Decimal('11.7647'), 'Q1 25%'),
 (16, 'Gautam', 'MECH', 51, 4, 17, Decimal('17.6471'), 'Q1 25%'),
 (4, 'Rupesh', 'EEE', 55, 5, 17, Decimal('23.5294'), 'Q1 25%'),
 (3, 'Anukant', 'EEE', 69, 7, 17, Decimal('35.2941'), 'Q2 50%'),
 (14, 'Amit', 'MECH', 69, 7, 17, Decimal('35.2941'), 'Q2 50%'),
 (13, 'Prashant', 'MECH', 75, 8, 17, Decimal('41.1765'), 'Q2 50%'),
 (5, 'Shubham', 'CSE', 78, 9, 17, Decimal('47.0588'), 'Q2 50%'),
 (11, 'Anand', 'ECE', 81, 10, 17, Decimal('52.9412'), 'Q3 75%'),
 (1, 'Nitish', 'EEE', 82, 11, 17, Decimal('58.8235'), 'Q3 75%'),
 (10, 'Ankit', 'ECE', 88, 12, 17, Decimal('64.7059'), 'Q3 75%'),
 (2, 'Rishabh', 'EEE', 91, 13, 17, Decimal('70.5882'), 'Q3 75%'),
 (8, 'Arpan', 'CSE', 95, 16, 17, Decimal('88.2353'), 'Q4 100%'),
 (12, 'Rohit', 'ECE', 95, 16, 17, Decimal('88.2353'), 'Q4 100%'),
 (9, 'Vinay', 'ECE', 95, 16, 17, Decimal('88.2353'), 'Q4 100%'),
 (7, 'Deepak', 'CSE', 98, 17, 17, Decimal('94.1176'), 'Q4 100%')]

<hr>
<div style="text-align:left; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Summary
<i style="color:green;">
<ul>Ranking</ul>
<ul>Cumulative sum :<ol>{a,b,c..} = a,a+b,a+b+c ...</ol></ul><br>
<ul>Cumulative Average : <ol>X1+Xn / len(X)</ol></ul><br>
<ul>Running Average : <ol>X1+X(window_size) / len(X)</ol></ul><br>
<ul>Percent of total : <ol>(important_quantity / sum(whole data) )  * 100</ol></ul><br>
<ul>Percent Change :<ol>(new_value - old_value) / old_value * 100</ol></ul><br>
<ul>Quantiles :<ol>Quantile = ((Current Row  - 1) / total Row * ) 100</ol></ul>
</i></div>